import mmap, struct, os, sys
from time import gmtime, strftime, time
import LinuxMemory as linux

class AddressSpace(linux.AMD64PagedMemory):
#class AddressSpace():
    def __init__(self, mem_path, dtb = 0, verbose = 0):
        try:
            f = os.open(mem_path, os.O_RDONLY)
        except:
            print("Error: open image failed!\n")
            sys.exit(1)
        # mapping memory snapshot to memory
        try:
            self.mem = mmap.mmap(f, 0, mmap.MAP_SHARED, mmap.ACCESS_READ)
        except:
            print("Error: mapping memory snapshot failed!\n")
        self.verbose = verbose
        self.mem_path = mem_path
        self.image_name = os.path.basename(self.mem_path)
        self.dtb_paddr = dtb
        self.version_index = 0
        if not os.path.exists(self.image_name + '_metadata'):
            self.mem.seek(0)
            if b'ELF' in self.mem.read(6):
                self.has_elf_header = True
                self.offset = self.parse_elf_header()
                print("elf header", self.offset)
            else:
                self.has_elf_header = False
                print("no elf header")

            #identify Linux kernel version
            self.LinuxVersion = self.findLinuxVersion()
            print("linux version", self.LinuxVersion)
            #recover kernel symbols
            if not os.path.exists(self.image_name + '_symbol_table'):
                version_num = self.LinuxVersion.split('.')
                if int(version_num[0]==4):
                    if int(version_num[1]) < 6:
                        self.find_kallsyms_address_pre_46()
                    else:
                        self.find_kallsyms_address(self.version_index)
                elif int(version_num[0]) < 4:
                    exit(0)
                    self.find_kallsyms_address_pre_46()
                else:
                    self.find_kallsyms_address(self.version_index)

            # find dtb vaddr from memory snapshot
            # This symbol address is shifted by virtual kaslr shift
            # the same symbol recovered from the kernel symbol table is not shifted
            # substracting one from another, we can get the virtual kaslr shift
            # it's possible that SYMBOL(swapper_pg_dir) cannot be found from the memory snapshot
            vdtb_idx = self.mem.find(b'SYMBOL(swapper_pg_dir)=') + len("SYMBOL(swapper_pg_dir)=")
            if vdtb_idx-len("SYMBOL(swapper_pg_dir)=")>0:
                self.dtb_vaddr = '0x' + self.mem_read(vdtb_idx, 16)
                print("dtb_vaddr", self.dtb_vaddr)
            else:
                print("cannot find dtb_vaddr")
                self.dtb_vaddr = None
            #self.find_kallsyms_address()
            self.kaslr_shift_vtop = self.kaslr_vtop_shift('kallsyms_on_each_symbol')
            self.kaslr_shift_vtov, self.dtb_paddr = self.kaslr_vtov_shift()
            print("vtop shift {0} vtov shift {1} dtb_paddr {2}".format(hex(self.kaslr_shift_vtop), hex(self.kaslr_shift_vtov), hex(self.dtb_paddr)))

    def find_page_table(self, dtb):
        offset = dtb & 0xfff
        for step in range(offset, self.mem.size(), 4096):
            if self.maybe_vtop(self.dtb_vaddr, step)==step:
                print("found dtb")
    def log(self, message):
        print('%s\t%s' %(strftime("%Y-%m-%d %H:%M:%S", gmtime()), message))
        sys.stdout.flush()
    # locate index of a certain string in the memory snapshot
    def mem_find(self, target_string):
        pass
    # read bytes from the memory snapshot and return a string
    def mem_read(self, index, length):
        self.mem.seek(index)
        return self.mem.read(length).decode('utf-8')
    def translate(self, addr):
        for input_addr, output_addr, length in self.offset:
            if addr >= input_addr and addr < input_addr + length:
                return output_addr + (addr - input_addr)
            if addr < input_addr:
                return None
        return None
    def read_memory(self, paddr, length):
        if self.has_elf_header:
            paddr = self.translate(paddr)
            if not paddr:
                return None
        if self.mem.size()-paddr < length:
            return None
        self.mem.seek(paddr)
        return self.mem.read(length)
    def findLinuxVersion(self):
        version_idx = self.mem.find(b'Linux version 5')
        if version_idx < 0:
            version_idx = self.mem.find(b'Linux version 4')
        if version_idx < 0:
            version_idx = self.mem.find(b'Linux version 3')
        if version_idx < 0:
            version_idx = self.mem.find(b'Linux version 2')
        if version_idx < 0:
            print('Error: cannot find Linux version or it is too old')
            return 0
        print("linux version index", hex(version_idx))
        self.version_index = version_idx
        self.mem.seek(version_idx + len('Linux version '))
        version = self.mem.read(8).decode('utf-8')
        major_ver_idx = version.index('.')
        minor_ver_idx = version[major_ver_idx+1:].index('.')
        return version[:major_ver_idx+minor_ver_idx+1]

    def _read_memory(self, paddr, length):
        '''
        This function is for reading elf header
        '''
        if paddr > 1024:
            sys.exit(1)
        self.mem.seek(paddr)
        value = self.mem.read(length)
        if not value:
            print("Error: fail to read memory at", hex(paddr))
        elif length == 2:
            value = struct.unpack('<H', value)[0]
        elif length == 4:
            value = struct.unpack('<I', value)[0]
        elif length == 8:
            value = struct.unpack('<Q', value)[0]
        return value

    def parse_elf_header(self):
        '''
        Parse elf header 64
        '''
        #elf64_header definition from Volatility
        elf64_header = {
            'e_ident' : [ 0, ['String', dict(length = 16)]],
            'e_type' : [ 16, ['Enumeration', dict(target = 'unsigned short', choices = {
                0: 'ET_NONE',
                1: 'ET_REL',
                2: 'ET_EXEC',
                3: 'ET_DYN',
                4: 'ET_CORE',
                0xff00: 'ET_LOPROC',
                0xffff: 'ET_HIPROC'})]],
            'e_machine' : [ 18, ['unsigned short']],
            'e_version' : [ 20, ['unsigned int']],
            'e_entry' : [ 24, ['unsigned long long']],
            'e_phoff' : [ 32, ['unsigned long long']],
            'e_shoff' : [ 40, ['unsigned long long']],
            'e_flags' : [ 48, ['unsigned int']],
            'e_ehsize'    : [ 52, ['unsigned short']],
            'e_phentsize' : [ 54, ['unsigned short']],
            'e_phnum'     : [ 56, ['unsigned short']],
            'e_shentsize' : [ 58, ['unsigned short']],
            'e_shnum'     : [ 60, ['unsigned short']],
            'e_shstrndx'  : [ 62, ['unsigned short']],
        }
        elf64_pheader = {
            'p_type' : [ 0, ['Enumeration', dict(target = 'unsigned int', choices = {
                0: 'PT_NULL',
                1: 'PT_LOAD',
                2: 'PT_DYNAMIC',
                3: 'PT_INTERP',
                4: 'PT_NOTE',
                5: 'PT_SHLIB',
                6: 'PT_PHDR',
                7: 'PT_TLS',
                0x60000000: 'PT_LOOS',
                0x6fffffff: 'PT_HIOS',
                0x70000000: 'PT_LOPROC',
                0x7fffffff: 'PT_HIPROC'})]],
            'p_flags' : [ 4, ['unsigned int']],
            'p_offset' : [ 8, ['unsigned long long']],
            'p_vaddr' : [ 16, ['unsigned long long']],
            'p_paddr' : [ 24, ['unsigned long long']],
            'p_filesz' : [ 32, ['unsigned long long']],
            'p_memsz' : [ 40, ['unsigned long long']],
            'p_align' : [ 48, ['unsigned long long']],
        }
        header_size = 56
        e_phoff = self._read_memory(elf64_header['e_phoff'][0], 4)
        e_phnum = self._read_memory(elf64_header['e_phnum'][0], 4)
        if e_phnum > 128:
            e_phnum = 128
        #e_phoff = 64
        #e_phnum = 7
        runs = []
        for i in range(e_phnum):
            idx = i * header_size
            p_type = self._read_memory(e_phoff + idx + elf64_pheader['p_type'][0], 2)
            p_filesz = self._read_memory(e_phoff + idx + elf64_pheader['p_filesz'][0], 8)
            p_memsz = self._read_memory(e_phoff + idx + elf64_pheader['p_memsz'][0], 8)
            if p_type != 1 or p_filesz == 0 or p_filesz != p_memsz:
                continue
            p_paddr = self._read_memory(e_phoff + idx + elf64_pheader['p_paddr'][0], 8)
            p_offset = self._read_memory(e_phoff + idx + elf64_pheader['p_offset'][0], 8)
            p_memsz = self._read_memory(e_phoff + idx + elf64_pheader['p_memsz'][0], 8)
            runs.append((int(p_paddr), int(p_offset), int(p_memsz)))
        return runs
    def find_kallsyms_address_pre_46(self):
        pass
    def find_token_table(self, kallsyms_names_paddr):
        # token_table address is larger than kallsyms_names_paddr
        # Start search from kallsyms_names_paddr
        self.log("Start to find kallsyms_token_table")
        #Estimisted gap 4096*0x100
        kallsyms_token_table_addr = kallsyms_names_paddr #+ 4096*250
        candidate = []
        # Read the content
        for step in range(kallsyms_token_table_addr, self.mem.size(), 8):
            kallsyms_token_table = ""
            kallsyms_token_table_v = []
            # Table_size is larger than 512 in reality
            table_size = 512/8
            init_addr = step
            while table_size:
                content = self.read_memory(init_addr, 8)
                if not content:
                    break
                #print(content)
                content = "".join(map(chr, content))
                #for item in content:
                #    kallsyms_token_table_v.append(struct.unpack("<c", item)[0])
                kallsyms_token_table += content
                init_addr += 8
                table_size -= 1
            if table_size > 1:
                continue
            table_size = 512/8

            #print "t in table", kallsyms_token_table.count('\x00'), kallsyms_token_table.count('r'), len(kallsyms_token_table)
            # table length is less than 1000. around 300 zeros in it. let's exam 512 element of them.
            '''
                The characters in token_table are valid as per naming rules; they are combinations of
                letters, numbers and symbols like underscores
            '''
            # I changed this range for ARM64 images, it used to be 46-125 for x86_64
            if not all(ord(c)>=36 and ord(c)<125 or ord(c)==0 for c in kallsyms_token_table):
                #print "pass"
                continue
            '''
                The elements in token_table in grouped and bounded by '\x00'
                no successive apperance of '\x00'
            '''
            if "\x00\x00" in kallsyms_token_table:
                #print "not pass"
                continue
            '''
                Compute the distance of each '\x00'. distance >= 1 and is normally less than 15.
                15 is somehow experimental.
            '''
            zero_index = [i for i, j in enumerate(kallsyms_token_table) if j == '\x00']
            for idx in reversed(range(1, len(zero_index))):
                zero_index[idx] = zero_index[idx] - zero_index[idx-1]
            #21 is somehow based on heuristic
            if any(c > 21 for c in zero_index):
                #print zero_index
                continue
            candidate.append(step)
            break
        if len(candidate) == 0:
            print("kallsyms_token_table not found")
        else:
